docs/index.html
---
layout: default
---
<div id="outline-container-org758b41d" class="outline-2">
<h2 id="org758b41d">Motivation</h2>
<div class="outline-text-2" id="text-org758b41d">
<p>
I think many Emacs users often feel not user-friendly to use the software 
where we cannot use Emacs-like keybindings. 
If we have to use such software many times, I think we should change the 
keybindings and perhaps make some new function to use similary to Emacs.
I often use Excel, Word and some other sofwares of Microsoft especially in
my office. So I firstly made Excel VBA module file to enable Emacs users 
to use Excel with less stress.
</p>
</div>
</div>
<div id="outline-container-org86ccf8a" class="outline-2">
<h2 id="org86ccf8a">Features</h2>
<div class="outline-text-2" id="text-org86ccf8a">
<ul class="org-ul">
<li>Emacs-like selection moving (forward: <code>C-f</code>, backward: <code>C-b</code>, next: <code>C-n</code>, previous: <code>C-p</code>)</li>
<li>Move end/start in the active row (end: <code>C-e</code>, start: <code>C-a</code>)</li>
<li>Kill/Insert row (kill: <code>C-k</code> insert: <code>C-i</code>)</li>
<li>Keep windows common keybindings (Copy: <code>C-c</code>, Paste: <code>C-v</code>)</li>
<li>Scroll up/down (up: <code>C-u</code>, down: <code>C-d</code>)</li>
<li>Other powerful functions
<ul class="org-ul">
<li><code>SheetForward</code> / <code>SheetPrevious</code> : Select the next/previous sheet</li>
<li><code>CreateSheet</code> : Create the new sheet named by your input</li>
<li><code>MoveRow</code> / <code>MoveCol</code> : Move the selection toward the row/column direction by inputted number/alphabet</li>
</ul></li>
<li>Refered to EmacsMode.bas in <a href="https://gist.github.com/nozma/2603524#file-emacsmode-bas">this</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge474a36" class="outline-2">
<h2 id="orge474a36">Install</h2>
<div class="outline-text-2" id="text-orge474a36">
<p>
Simply import the module file <code>myEmacsKey.bas</code> and execute.
Refer to <a href="https://github.com/kkatsuyuki/myExcelVbaEmacsKey">README</a> in details.
</p>
</div>
</div>
<div id="outline-container-org3362024" class="outline-2">
<h2 id="org3362024">Details</h2>
<div class="outline-text-2" id="text-org3362024">
<p>
Refer to <a href="https://github.com/kkatsuyuki/myExcelVbaEmacsKey">README</a>.
</p>
</div>
</div>
